[
  {
    "name": "SSD Nodes",
    "description": "SSD Nodes menawarkan VPS yang laju, mampu milik dan sesuai untuk projek jangka panjang. Dengan storage SSD yang besar dan harga jauh lebih murah berbanding pesaing, ia pilihan terbaik kalau nak server sendiri dengan bajet rendah.",
    "link": "https://www.ssdnodes.com/manage/aff.php?aff=1124&register=true"
  },
  {
    "name": "Digital Ocean",
    "description": "DigitalOcean terkenal sebagai platform cloud yang mudah digunakan, stabil dan mesra developer. Sesuai untuk host website, app moden atau projek SaaS. Pilihan fleksibel dengan dokumentasi lengkap untuk bantu setup dengan cepat.",
    "link": "https://m.do.co/c/a761f3cd7b28"
  },
  {
    "name": "Invois.online",
    "description": "Invois Online memudahkan anda hasilkan invois dan resit digital secara automatik. Sesuai untuk freelancer, peniaga kecil mahupun syarikat yang nak urus kewangan dengan lebih teratur. Tak perlu lagi pening dengan template manual – semuanya siap terus dari sistem.",
    "link": "https://invois.online/promo/KBO4OV"
  },
  {
    "name": "Certificate.ala.my",
    "description": "Membolehkan anda jana sijil kursus dan sijil digital dengan mudah dan pantas. Sesuai untuk seminar, bengkel atau kursus latihan yang perlukan dokumen pengiktirafan. Anda hanya perlu isi maklumat yang diperlukan dan boleh terus edarkan sijil secara digital.",
    "link": "https://certificate.ala.my/promo/JEYVNV"
  },
  {
    "name": "SenangPay",
    "description": "SenangPay ialah payment gateway Malaysia yang mesra peniaga. Ia membolehkan anda terima bayaran secara online melalui FPX, kad kredit atau e-wallet dengan mudah. Sangat membantu usahawan yang nak kembangkan bisnes e-commerce tanpa pening uruskan integrasi rumit.",
    "link": "https://senangpay.my/register/?referral=64599"
  },
  {
    "name": "Kodekloud",
    "description": "Engineer.KodeKloud membolehkan anda belajar dengan cara praktikal melalui tugasan sebenar menggunakan sistem sebenar. Anda boleh mengasah kemahiran deployment, troubleshooting, konfigurasi server dan operasi sistem sebenar — bukan sekadar tutorial. Sesuai untuk mereka yang nak pengalaman hands-on sebagai SysAdmin, DevOps atau SRE.",
    "link": "https://engineer.kodekloud.com/signup?referral=6527c952851bade729fa8eeb"
  }
]